---
type: StairsRunType
namespace: Autodesk.Revit.DB.Architecture
version: 2024
members: 17
tags: [revit-api, class]
---

# StairsRunType

`Autodesk.Revit.DB.Architecture.StairsRunType` · Revit 2024 · 17 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | HasRisers | 2013 | `public bool HasRisers { get ; set ; }` |
| Property | HasTreads | 2013 | `public bool HasTreads { get ; set ; }` |
| Property | IsMonolithic | 2013 | `public bool IsMonolithic { get ; }` |
| Property | IsSlanted | 2013 | `public bool IsSlanted { get ; set ; }` |
| Property | MaterialId | 2013 | `public ElementId MaterialId { get ; set ; }` |
| Property | NosingLength | 2013 | `public double NosingLength { get ; set ; }` |
| Property | NosingProfile | 2013 | `public ElementId NosingProfile { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | RiserProfile | 2013 | `public ElementId RiserProfile { get ; set ; }` |
| Property | RiserThickness | 2013 | `public double RiserThickness { get ; set ; }` |
| Property | RiserToTreadConnect | 2013 | `public RiserToTreadConnectionOption RiserToTreadConnect { get ; set ; }` |
| Property | StructuralDepth | 2013 | `public double StructuralDepth { get ; set ; }` |
| Property | TotalDepth | 2013 | `public double TotalDepth { get ; }` |
| Property | TreadNosingPosition | 2013 | `public TreadNosingPosition TreadNosingPosition { get ; set ; }` |
| Property | TreadProfile | 2013 | `public ElementId TreadProfile { get ; set ; }` |
| Property | TreadThickness | 2013 | `public double TreadThickness { get ; set ; }` |
| Property | UndersideSurfaceStyle | 2013 | `public StairsUndersideSurfaceStyle UndersideSurfaceStyle { get ; set ; }` |